package com.geo.saveprice;

/**
 * 
 * This class contains all the product names.
 * 
 */

public class Dictionary {
	
	static String[] storeNames = {"ΜΑΣΟΥΤΗΣ",
								  "ΜΑΡΙΝΟΠΟΥΛΟΣ",
								  "ΛΙΝΤΛ"};
	
	static String[] masoutisDict = {"ΑΛΕΥΡΙ ΑΛΛΑΤΙΝΗ ΓΟΧ ST-0,2",
									"ΧΑΡΤΟΠΕΤΣΕΤΕΣ MR GRAND ΛΕΥ",
									"CHIPS LAYS ΡΙΓΑΝΗ 130ΓΡ+20",
									"ΑΜΙΤΑ ΠΟΡΤΟΚΑΛΙ 100% 1LIT",
									"ΣΟΚΟΦΡΕΤΑ ΙΟΝ 38ΓΡ Ν08104/",
									"ΦΡΥΓΑΝΙΕΣ MR GRAND *1Π",
							        "MR GRAND ΤΑΜΠΛΕΤΕΣ *1Π",
							        "MR GRAND CHLOROACTI*1Π",
							        "POP CORN POP O TOPS 70ΓΡ Α",
							        "ΚΟΥΝΟΥΠΙΔΙ ΕΛΛΗΝΙΚΟ ΚΛ.Ι",
							        "ΜΠΡΟΚΟΛΟ ΕΛΛΗΝΙΚΟ ΚΛ.Ι",
							        "ΤΥΡΙ ΦΕΤΑ ΗΠΕΙΡΟΣ ΔΟΧΕΙΟ Χ",
							        "ΣΙΜΙΓΔΑΛΙ ΜΥΛΟΙ ΑΓ ΓΕΩΡΓΙΟΥ",
							        "ΧΥΜΟΣ ΝΕΚΤ MR GRAND*1Π",
							        "ΖΑΧΑΡΗ MR GRAND 1K",
							        "ΥΠΟΒΡΥΧΙΟ ΜΑΣΤΙΧΑ CULTURA",
							        "ΦΙΛΤΡΑ ΚΑΦΕ MR GRAND*1Π",
							        "ΣΟΚΟΦΡΕΤΑ ΙΟΝ ST-0,20E 4X3",
							        "ΠΤΙ ΜΠΕΡ ΠΑΠΑΔ 2Χ225ΓΡ ST-",
							        "COCA COLA ΚΟΥΤΙ 6Χ330ML",
							        "ΤΥΡΙ ΧΩΡΙΑΤΙΚΟ ΛΕΥΚΟ ΟΛΥΜΠ",
							        "ΣΑΚΟΥΛΕΣ FIN BAGS N200",
							        "ΣΑΚΟΥΛΕΣ FIN BAGS N300",
							        "ΦΙΑΛΑΚΙΑ ΥΓΡΑΕΡΙΟΥ CAMPING",
							        "ΣΙΜΙΓΔΑΛΙ ΑΛΑΤΙΝΗ ΧΟΝΔΡΟ",
							        "ΞΥΔΙ ΑΓΡΟΞ ΑΠΛΟ 400Γ",
							        "ΣΚΟΥΠΑ PALAI CLAREX",
							        "ΧΛΩΡΙΝΗ KLINEX LEMON 2LIT",
							        "ΓΙΑΟΥΡ ΣΤΡΑΓΓ ΜΕΒΓΑΛ 10% S",
							        "ΓΑΛΑ ΜΕΒΓΑΛ 3,5% ST-0,15E",
							        "ΦΙΔΕΣ ΑΒΕΖ EXTRA 250ΓΡ",
							        "ΑΛΕΥΡΙ ΜΑΝΝΑ ΚΙΤΡΙΝΟ 1ΚΙΛΟ",
							        "ΦΡΥΓΑΝΙΕΣ ΣΙΚΑΛ ΠΑΠΑΔΟΠΟΥΛ",
							        "ΞΥΔΙ MR GRAND 400ΓΡ*1Π",
							        "ΑΛΕΥΡΙ ΦΑΡΙΝ ΑΠ-0,25Ε 500Γ",
							        "ΜΠΙΣΚΟΤΑ ΜΙΡΑΝΤΑ Ν16 ST-0,",
							        "ΑΛΑΤΙ ΓΛΑΡΟΣ ΨΙΛΟ ΠΑΚΕΤΟ 5",
							        "ΚΑΝΕΛΑ MR GRAND ΤΡΙ*1Π",
							        "COCA COLA ΚΟΥΤΙ 330ML 6+2Δ",
									"ΣΥΝΟΛΟ",
							        "ΜΕΤΡΗΤΑ",
							        "ΡΕΣΤΑ"};
	
	static String[] masoutisParallelDict = {"ΑΛΕΥΡΙ ΑΛΛΑΤΙΝΗ 1KG",
											"ΧΑΡΤΟΠΕΤΣΕΤΕΣ 100 TEMAXIA",
											"CHIPS LAYS ΡΙΓΑΝΗ",
											"ΧΥΜΟΣ ΑΜΙΤΑ ΠΟΡΤΟΚΑΛΙ 1 ΛΙΤΡΟ",
											"ΣΟΚΟΦΡΕΤΑ ΙΟΝ",
											"ΦΡΥΓΑΝΙΕΣ MR GRAND *1Π",
									        "MR GRAND ΤΑΜΠΛΕΤΕΣ *1Π",
									        "MR GRAND CHLOROACTI*1Π",
									        "POP CORN POP O TOPS 70ΓΡ Α",
									        "ΚΟΥΝΟΥΠΙΔΙ ΕΛΛΗΝΙΚΟ ΚΛ.Ι",
									        "ΜΠΡΟΚΟΛΟ ΕΛΛΗΝΙΚΟ ΚΛ.Ι",
									        "ΤΥΡΙ ΦΕΤΑ ΗΠΕΙΡΟΣ ΔΟΧΕΙΟ Χ",
									        "ΣΙΜΙΓΔΑΛΙ ΜΥΛΟΙ ΑΓ ΓΕΩΡΓΙΟΥ",
									        "ΧΥΜΟΣ ΝΕΚΤ MR GRAND*1Π",
									        "ΖΑΧΑΡΗ MR GRAND 1K",
									        "ΥΠΟΒΡΥΧΙΟ ΜΑΣΤΙΧΑ CULTURA",
									        "ΦΙΛΤΡΑ ΚΑΦΕ MR GRAND*1Π",
									        "ΣΟΚΟΦΡΕΤΑ ΙΟΝ ST-0,20E 4X3",
									        "ΠΤΙ ΜΠΕΡ ΠΑΠΑΔ 2Χ225ΓΡ ST-",
									        "COCA COLA ΚΟΥΤΙ 6Χ330ML",
									        "ΤΥΡΙ ΧΩΡΙΑΤΙΚΟ ΛΕΥΚΟ ΟΛΥΜΠ",
									        "ΣΑΚΟΥΛΕΣ FIN BAGS N200",
									        "ΣΑΚΟΥΛΕΣ FIN BAGS N300",
									        "ΦΙΑΛΑΚΙΑ ΥΓΡΑΕΡΙΟΥ CAMPING",
									        "ΣΙΜΙΓΔΑΛΙ ΑΛΑΤΙΝΗ ΧΟΝΔΡΟ",
									        "ΞΥΔΙ ΑΓΡΟΞ ΑΠΛΟ 400Γ",
									        "ΣΚΟΥΠΑ PALAI CLAREX",
									        "ΧΛΩΡΙΝΗ KLINEX LEMON 2LIT",
									        "ΓΙΑΟΥΡ ΣΤΡΑΓΓ ΜΕΒΓΑΛ 10% S",
									        "ΓΑΛΑ ΜΕΒΓΑΛ 3,5% ST-0,15E",
									        "ΦΙΔΕΣ ΑΒΕΖ EXTRA 250ΓΡ",
									        "ΑΛΕΥΡΙ ΜΑΝΝΑ ΚΙΤΡΙΝΟ 1 ΚΙΛΟ",
									        "ΦΡΥΓΑΝΙΕΣ ΣΙΚΑΛΗΣ ΠΑΠΑΔΟΠΟΥΛΟΥ",
									        "ΞΥΔΙ MR GRAND 400ΓΡ",
									        "ΑΛΕΥΡΙ ΦΑΡΙΝ 500Γ",
									        "ΜΠΙΣΚΟΤΑ ΜΙΡΑΝΤΑ",
									        "ΑΛΑΤΙ ΓΛΑΡΟΣ ΨΙΛΟ ΠΑΚΕΤΟ",
									        "ΚΑΝΕΛΑ MR GRAND",
									        "COCA COLA ΚΟΥΤΙ 330ML 6+2ΔΩΡΟ",
											};
									/*
									
							        */
	
	static String[] lidlDict = {"ΑΛΛΑΤΙΝ.ΑΛ.Γ.Ο.Χ.1KG",
								"ΧΑΡΤΟΠΕΤΣΕΤΕΣ 100ΤΕΜ",
								"LAY'S CHIPS OREG200G",
								"ΑΜΙΤΑ ΧΥΜ.ΠΟΡΤΟΚ.1L",
								"ΙΟΝ ΣΟΚΟΦΡΕ.ΓΑΛΑ.38G",
								"ΜΕΡΙΚΟ ΣΥΝΟΛΟ",
								"ΣΥΝΟΛΟ ΜΕΤΑ ΦΟΡΟΥ",
								"Check ΔΩΡΟΥ",
								"ΜΕΤΡΗΤΟΙΣ",
						        "ΡΕΣΤΑ"};
	
	static String[] lidlParallelDict = {"ΑΛΕΥΡΙ ΑΛΛΑΤΙΝΗ 1KG",
										"ΧΑΡΤΟΠΕΤΣΕΤΕΣ 100 TEMAXIA",
										"CHIPS LAYS ΡΙΓΑΝΗ",
										"ΧΥΜΟΣ ΑΜΙΤΑ ΠΟΡΤΟΚΑΛΙ 1 ΛΙΤΡΟ",
										"ΣΟΚΟΦΡΕΤΑ ΙΟΝ",
										};
	
	static String[] marinopoulosDict = {"-0.21 ΑΛΕΥΡ ΑΛΑΤΙΝ",
										"ΧΑΡΤΟΠΕΤΣΕΤΑ 30Χ30",
										"ΤΣΙΠΣ LAYS 130ΓΡ",
										"ΧΥΜΟΣ ΠΟΡΤ ΑΜΙΤΑ 1",
										"ΣΟΚΟΦΡΕΤΑ ΙΟΝ 38GR",
										"ΜΕΡΙΚΟ ΣΥΝΟΛΟ",
										"ΣΥΝΟΛΟ ΜΕΤΑ ΦΟΡΟΥ",
										"Check ΔΩΡΟΥ",
										"ΜΕΤΡΗΤΑ",
								        "ΡΕΣΤΑ"};
	
	static String[] marinopoulosParallelDict = {"ΑΛΕΥΡΙ ΑΛΛΑΤΙΝΗ 1KG",
												"ΧΑΡΤΟΠΕΤΣΕΤΕΣ 100 TEMAXIA",
												"CHIPS LAYS ΡΙΓΑΝΗ",
												"ΧΥΜΟΣ ΑΜΙΤΑ ΠΟΡΤΟΚΑΛΙ 1 ΛΙΤΡΟ",
												"ΣΟΚΟΦΡΕΤΑ ΙΟΝ",
												};
	
}
